### Shark attaks

In [1]:
!pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\anna\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: openpyxl in c:\users\anna\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in c:\users\anna\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\anna\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\anna\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\anna\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: et-xmlfile in c:\users\anna\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\anna\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\anna\anaconda3\lib\site-packages (2.1.3)

In [4]:
import numpy as np

In [5]:
df = pd.read_excel ("data/raw/GSAF5.xls")
df.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,...,Nurse shark,Kevin McMurray Trackingsharks.com Andy Currie,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,...,Tiger or Bull shark,Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,...,Bronze whaler?,Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,...,unknown 1.2m shark,Todd Smith: Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,...,Tiger shark 4m,Todd Smith: Kevin McMurray Trackingsharks.com,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df.tail()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
7045,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,...,NaN,"H. Taunton; N. Bartlett, p. 234",ND-0005-RoebuckBay.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0005,ND.0005,6.0,NaN,NaN
7046,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,...,NaN,"H. Taunton; N. Bartlett, pp. 233-234",ND-0004-Ahmun.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0004,ND.0004,5.0,NaN,NaN
7047,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,...,NaN,"F. Schwartz, p.23; C. Creswell, GSAF",ND-0003-Ocracoke_1900-1905.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0003,ND.0003,4.0,NaN,NaN
7048,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,...,NaN,"The Sun, 10/20/1938",ND-0002-JulesPatterson.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0002,ND.0002,3.0,NaN,NaN
7049,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,...,NaN,S.W. Baker,ND-0001-Ceylon.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,ND.0001,ND.0001,2.0,NaN,NaN

In [7]:
df.shape

(7050, 23)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7050 entries, 0 to 7049
Data columns (total 23 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            7050 non-null   object
 1   Year            7048 non-null   float64
 2   Type            7032 non-null   object
 3   Country         7000 non-null   object
 4   State           6564 non-null   object
 5   Location        6483 non-null   object
 6   Activity        6465 non-null   object
 7   Name            6831 non-null   object
 8   Sex             6471 non-null   object
 9   Age             4056 non-null   object
 10  Injury          7015 non-null   object
 11  Fatal Y/N       6489 non-null   object
 12  Time            3524 non-null   object
 13  Species         3919 non-null   object
 14  Source          7030 non-null   object
 15  pdf             6799 non-null   object
 16  href formula    6794 non-null   object
 17  href            6796 non-null   object
 18  Case Number     6798 non-null   object
 19  Case Number.1   6797 non-null   object
 20  original order  6799 non-null   float64
 21  Unnamed: 21     1 non-null      object
 22  Unnamed: 22     2 non-null      object
dtypes: float64(2), object(21)
memory usage: 1.2+ MB

In [9]:
df.columns.tolist() # I see extra columns that were probably hidden in the excel file

['Date',
 'Year',
 'Type',
 'Country',
 'State',
 'Location',
 'Activity',
 'Name',
 'Sex',
 'Age',
 'Injury',
 'Fatal Y/N',
 'Time',
 'Species ',
 'Source',
 'pdf',
 'href formula',
 'href',
 'Case Number',
 'Case Number.1',
 'original order',
 'Unnamed: 21',
 'Unnamed: 22']

In [10]:
df = df.iloc[:, :-9] # removing last 9 columns
df

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Time,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Not stated,Nurse shark
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,Serious abdonminal injuries,N,1823 hrs,Tiger or Bull shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,1330hrs,Bronze whaler?
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,Leg and foot injury,N,0100hrs,unknown 1.2m shark
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,Head face and arms,N,Not stated,Tiger shark 4m
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7045,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,FATAL,Y,NaN,NaN
7046,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,FATAL,Y,NaN,NaN
7047,1900-1905,0.0,Unprovoked,USA,North Carolina,Ocracoke Inlet,Swimming,Coast Guard personnel,M,NaN,FATAL,Y,NaN,NaN
7048,1883-1889,0.0,Unprovoked,PANAMA,NaN,"Panama Bay 8ºN, 79ºW",NaN,Jules Patterson,M,NaN,FATAL,Y,NaN,NaN
7049,1845-1853,0.0,Unprovoked,CEYLON (SRI LANKA),Eastern Province,"Below the English fort, Trincomalee",Swimming,male,M,15,"FATAL. ""Shark bit him in half, carrying away t...",Y,NaN,NaN

In [11]:
df.columns.tolist() # Now I have 14 columns that I need

['Date',
 'Year',
 'Type',
 'Country',
 'State',
 'Location',
 'Activity',
 'Name',
 'Sex',
 'Age',
 'Injury',
 'Fatal Y/N',
 'Time',
 'Species ']

In [12]:
df.nunique()

Date         6094
Year          261
Type           13
Country       249
State         939
Location     4598
Activity     1608
Name         5774
Sex            10
Age           251
Injury       4167
Fatal Y/N      12
Time          462
Species      1729
dtype: int64

In [13]:
df.select_dtypes

<bound method DataFrame.select_dtypes of                 Date    Year        Type             Country  \
0       14th October  2025.0  Unprovoked            Columbia
1       11th October  2025.0  Unprovoked           Australia
2        7th October  2025.0  Unprovoked           Australia
3     29th September  2025.0  Unprovoked                 USA
4     27th September  2025.0    Provoked          Costa Rica
...              ...     ...         ...                 ...
7045     Before 1903     0.0  Unprovoked           AUSTRALIA
7046     Before 1903     0.0  Unprovoked           AUSTRALIA
7047       1900-1905     0.0  Unprovoked                 USA
7048       1883-1889     0.0  Unprovoked              PANAMA
7049       1845-1853     0.0  Unprovoked  CEYLON (SRI LANKA)

                      State                             Location  \
0      Bolivar, del Isolate                    Catagena Province
1                Queensland       Cook Esplanade Thursday Island
2           South Australia                      Kangaroo Island
3            Off California                      Catalina Island
4                       NaN                        Cocos Islands
...                     ...                                  ...
7045      Western Australia                          Roebuck Bay
7046      Western Australia                                  NaN
7047         North Carolina                       Ocracoke Inlet
7048                    NaN                 Panama Bay 8ºN, 79ºW
7049       Eastern Province  Below the English fort, Trincomalee

                   Activity                   Name Sex  Age  \
0      Swimming with sharks             Male child   M   14
1          Fishing/swimming             Samuel Nai   M   14
2                   Surfing           Lee Berryman   M  50+
3                  Swimming     Christopher Murray   M   54
4     Diving-Tagging sharks     Dr. Mauricio Hoyos   M   48
...                     ...                    ...  ..  ...
7045                 Diving                   male   M  NaN
7046           Pearl diving                  Ahmun   M  NaN
7047               Swimming  Coast Guard personnel   M  NaN
7048                    NaN        Jules Patterson   M  NaN
7049               Swimming                   male   M   15

                                                 Injury Fatal Y/N        Time  \
0                                    Severe hand injury         N  Not stated
1                           Serious abdonminal injuries         N    1823 hrs
2                                  Lacerations to calf          N     1330hrs
3                                   Leg and foot injury         N     0100hrs
4                                    Head face and arms         N  Not stated
...                                                 ...       ...         ...
7045                                              FATAL         Y         NaN
7046                                              FATAL         Y         NaN
7047                                              FATAL         Y         NaN
7048                                              FATAL         Y         NaN
7049  FATAL. "Shark bit him in half, carrying away t...         Y         NaN

                 Species
0            Nurse shark
1     Tiger or Bull shark
2          Bronze whaler?
3      unknown 1.2m shark
4          Tiger shark 4m
...                   ...
7045                  NaN
7046                  NaN
7047                  NaN
7048                  NaN
7049                  NaN

[7050 rows x 14 columns]>

In [14]:
df.dtypes

Date          object
Year         float64
Type          object
Country       object
State         object
Location      object
Activity      object
Name          object
Sex           object
Age           object
Injury        object
Fatal Y/N     object
Time          object
Species       object
dtype: object

In [15]:
df[["Year"]].tail() # year has missing values

      Year
7045   0.0
7046   0.0
7047   0.0
7048   0.0
7049   0.0

In [16]:
df[["Date"]].sample(20) # date includes the year

                      Date
5106           16-Jul-1953
5254           14-Jan-1949
3847           19-Jul-1978
6423                  1892
6737           06-Feb-1856
444            09-Oct-2020
3430           23-Oct-1988
4791           26-Sep-1959
5922  Reported 28-Mar-1924
406            02-Mar-2021
660            23-Oct-2018
2715           29-Oct-2000
5773           31-Aug-1930
190            29-Apr-2023
2229           18-Jan-2006
690            09-Aug-2018
5516                  1940
6014              Nov-1918
2358           20-Sep-2004
3241           25-Nov-1992

In [17]:
df["Temp_year"] = df["Date"].astype(str).str.extract(r'(\d{4})').astype(float) # adding new temporary column to extract 4 digits of year from the column Date
df["Temp_year"]

0          NaN
1          NaN
2          NaN
3          NaN
4          NaN
         ...
7045    1903.0
7046    1903.0
7047    1900.0
7048    1883.0
7049    1845.0
Name: Temp_year, Length: 7050, dtype: float64

In [18]:
df[['Date', 'Year', 'Temp_year']].sample(20)

                      Date    Year  Temp_year
735            22-Apr-2018  2018.0     2018.0
3225           12-Mar-1993  1993.0     1993.0
1580           28-Sep-2011  2011.0     2011.0
5660           31-Dec-1934  1934.0     1934.0
218            30-Dec-2022  2022.0     2022.0
5631  Reported 04-Sep-1935  1935.0     1935.0
1952           19-Jul-2008  2008.0     2008.0
3433           11-Oct-1988  1988.0     1988.0
4841  02-Feb-1959 Reported  1959.0     1959.0
3058           30-Sep-1995  1995.0     1995.0
3823           05 May 1979  1979.0     1979.0
1099           10-Aug-2015  2015.0     2015.0
6244           28-Jul-1904  1904.0     1904.0
1430           05-Jan-2013  2013.0     2013.0
1715           17-Aug-2010  2010.0     2010.0
3002           06-Sep-1996  1996.0     1996.0
4808           10-Aug-1959  1959.0     1959.0
2812              Nov-1999  1999.0     1999.0
377            12-Jun-2021  2021.0     2021.0
6838              Jun-1827  1827.0     1827.0

In [19]:
df['Year'] = df['Year'].fillna(df['Temp_year']) # Fill in the NaN in the Year column with the Temp year
df[['Date', 'Year', 'Temp_year']].sample(20)

                      Date    Year  Temp_year
5759           06-Mar-1931  1931.0     1931.0
4069           20-Feb-1972  1972.0     1972.0
4309           20-May-1966  1966.0     1966.0
1579           28-Sep-2011  2011.0     2011.0
4966           25-Aug-1956  1956.0     1956.0
5740           21-Sep-1931  1931.0     1931.0
6294           21-Aug-1900  1900.0     1900.0
4066           01-Apr-1972  1972.0     1972.0
6610                  1876  1876.0     1876.0
5583           15-Jun-1937  1937.0     1937.0
4347           30-Jul-1964  1965.0     1964.0
6434  Reported 27-Dec-1890  1890.0     1890.0
4815           23-Jul-1959  1959.0     1959.0
4901           19-Jan-1958  1958.0     1958.0
5422             Fall 1943  1943.0     1943.0
2395           01-May-2004  2004.0     2004.0
6873  Reported May-28-1797  1797.0     1797.0
126   Reported 02 Nov-2023  2023.0     2023.0
3385           17-Sep-1989  1989.0     1989.0
4006        Early Feb-1974  1974.0     1974.0

In [20]:
df_50 = df[~((df['Year'] < 1976) & (df['Temp_year'] < 1976))]
df_50[["Year", "Temp_year"]]

        Year  Temp_year
0     2025.0        NaN
1     2025.0        NaN
2     2025.0        NaN
3     2025.0        NaN
4     2025.0        NaN
...      ...        ...
7020     0.0        NaN
7023     0.0        NaN
7027     0.0        NaN
7028     0.0        NaN
7029     0.0        NaN

[3973 rows x 2 columns]

In [21]:
df_50['Match_check'] = df_50['Year'] == df_50['Temp_year']
df_50['Match_check']

C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\2696524239.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50['Match_check'] = df_50['Year'] == df_50['Temp_year']

0       False
1       False
2       False
3       False
4       False
        ...
7020    False
7023    False
7027    False
7028    False
7029    False
Name: Match_check, Length: 3973, dtype: bool

In [22]:
print(df_50['Match_check'].value_counts())

Match_check
True     3881
False      92
Name: count, dtype: int64

In [23]:
df_50_false = df_50[df_50['Match_check'] == False]
df_50_false [["Year", "Temp_year"]]

        Year  Temp_year
0     2025.0        NaN
1     2025.0        NaN
2     2025.0        NaN
3     2025.0        NaN
4     2025.0        NaN
...      ...        ...
7020     0.0        NaN
7023     0.0        NaN
7027     0.0        NaN
7028     0.0        NaN
7029     0.0        NaN

[92 rows x 2 columns]

In [24]:
df_50['Year'] = pd.to_numeric(df_50['Year'], errors='raise')   # turning the columns into numeric value to compare
df_50['Temp_year'] = pd.to_numeric(df_50['Temp_year'], errors='raise')

C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\3594179196.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50['Year'] = pd.to_numeric(df_50['Year'], errors='raise')   # turning the columns into numeric value to compare
C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\3594179196.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50['Temp_year'] = pd.to_numeric(df_50['Temp_year'], errors='raise')

In [25]:
df_50 = df_50[~(((df_50['Year'].isna()) | (df_50['Year'] == 0.0)) &
                 ((df_50['Temp_year'].isna()) | (df_50['Temp_year'] == 0.0)))]   # removing all rows that do not have any year information
df_50

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Time,Species,Temp_year,Match_check
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Not stated,Nurse shark,NaN,False
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,Serious abdonminal injuries,N,1823 hrs,Tiger or Bull shark,NaN,False
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,1330hrs,Bronze whaler?,NaN,False
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,Leg and foot injury,N,0100hrs,unknown 1.2m shark,NaN,False
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,Head face and arms,N,Not stated,Tiger shark 4m,NaN,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6969,"No date, Before Mar-1995",0.0,Unprovoked,FRENCH POLYNESIA,Tuamotus,Rangiroa,Fishing,male,M,NaN,"Speared a shark, fell overboard and another sh...",N,NaN,NaN,1995.0,False
6970,Before 1996,0.0,Unprovoked,SUDAN,Red Sea State,Sha'ab Rumi,Diving,Erik Bjurstrom,M,NaN,"No injury, BC ripped",N,NaN,Silvertip shark,1996.0,False
6971,"No date, Before Aug-1989",0.0,Unprovoked,VANUATU,Malampa Province,Malakula,NaN,female,F,NaN,FATAL,Y,NaN,NaN,1989.0,False
6972,"No date, Before Aug-1987",0.0,Provoked,VANUATU,Malampa Province,"Hokai, Malakula",Attempting to drive shark from area,a chief,M,NaN,Speared shark broke outrigger of canoe throwin...,N,NaN,A large hammerhead shark,1987.0,False
6973,"No date, Before 1987",0.0,Unprovoked,IRAN,Khuzestan Province,"Ahvaz, on the Karun River",NaN,Mr. Jabar-Kaaby,M,NaN,Foot severed,N,NaN,Bull shark,1987.0,False

In [26]:
df_50['Year'] = np.where(                                   # replacing missing value in Year with extracted value in Temp_year
    ((df_50['Year'].isna()) | (df_50['Year'] == 0.0)) &
    (df_50['Temp_year'].between(1000, 9999)),
    df_50['Temp_year'],
    df_50['Year']
)


df_50[["Year", "Temp_year"]]

        Year  Temp_year
0     2025.0        NaN
1     2025.0        NaN
2     2025.0        NaN
3     2025.0        NaN
4     2025.0        NaN
...      ...        ...
6969  1995.0     1995.0
6970  1996.0     1996.0
6971  1989.0     1989.0
6972  1987.0     1987.0
6973  1987.0     1987.0

[3960 rows x 2 columns]

In [27]:
df_50.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3960 entries, 0 to 6973
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         3960 non-null   object
 1   Year         3960 non-null   float64
 2   Type         3945 non-null   object
 3   Country      3954 non-null   object
 4   State        3790 non-null   object
 5   Location     3780 non-null   object
 6   Activity     3740 non-null   object
 7   Name         3888 non-null   object
 8   Sex          3731 non-null   object
 9   Age          2873 non-null   object
 10  Injury       3947 non-null   object
 11  Fatal Y/N    3690 non-null   object
 12  Time         2624 non-null   object
 13  Species      2567 non-null   object
 14  Temp_year    3925 non-null   float64
 15  Match_check  3960 non-null   bool
dtypes: bool(1), float64(2), object(13)
memory usage: 498.9+ KB

In [28]:
invalid_count = (~df_50['Year'].between(1000, 9999)).sum() # checking how many values are not 4 digits 
print("Number of invalid years:", invalid_count)

Number of invalid years: 2

In [29]:
df_50.loc[~df_50['Year'].between(1000, 9999), ['Date', 'Year', 'Temp_year']]

               Date  Year  Temp_year
6919   Ca. 77  A.D.  77.0        NaN
6920     Ca. 5 A.D.   5.0        NaN

In [30]:
df_50['Match_check'] = df_50['Year'] == df_50['Temp_year']
df_50['Match_check']

0       False
1       False
2       False
3       False
4       False
        ...
6969     True
6970     True
6971     True
6972     True
6973     True
Name: Match_check, Length: 3960, dtype: bool

In [31]:
print(df_50['Match_check'].value_counts())

Match_check
True     3906
False      54
Name: count, dtype: int64

In [32]:
df_50_false = df_50[df_50['Match_check'] == False]
df_50_false.info()

<class 'pandas.core.frame.DataFrame'>
Index: 54 entries, 0 to 6920
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         54 non-null     object
 1   Year         54 non-null     float64
 2   Type         54 non-null     object
 3   Country      53 non-null     object
 4   State        49 non-null     object
 5   Location     50 non-null     object
 6   Activity     50 non-null     object
 7   Name         54 non-null     object
 8   Sex          53 non-null     object
 9   Age          40 non-null     object
 10  Injury       54 non-null     object
 11  Fatal Y/N    49 non-null     object
 12  Time         41 non-null     object
 13  Species      43 non-null     object
 14  Temp_year    19 non-null     float64
 15  Match_check  54 non-null     bool
dtypes: bool(1), float64(2), object(13)
memory usage: 6.8+ KB

In [33]:
df_50[df_50['Temp_year'].isna()][['Date', 'Year', 'Temp_year']]

                      Date    Year  Temp_year
0             14th October  2025.0        NaN
1             11th October  2025.0        NaN
2              7th October  2025.0        NaN
3           29th September  2025.0        NaN
4           27th September  2025.0        NaN
5            6th September  2025.0        NaN
6            1st September  2025.0        NaN
7              30th August  2025.0        NaN
8              18th August  2025.0        NaN
9              17th August  2025.0        NaN
10             16th August  2025.0        NaN
11              7th August  2025.0        NaN
12              1st August  2025.0        NaN
13               28th July  2025.0        NaN
14               25th July  2025.0        NaN
15               22nd July  2025.0        NaN
16               20th July  2025.0        NaN
17               19th July  2025.0        NaN
18               18th July  2025.0        NaN
19               15th July  2025.0        NaN
20               6th July   2025.0        NaN
21                6th July  2025.0        NaN
22                4th July  2025.0        NaN
23               29th June  2025.0        NaN
24               25th June  2025.0        NaN
25               22nd June  2025.0        NaN
26               17th June  2025.0        NaN
28                31st May  2025.0        NaN
41               27-Feb-25  2025.0        NaN
485             10-Jul-202  2020.0        NaN
5379            22-Jul-144  1944.0        NaN
5537         Woirld War II  1939.0        NaN
5573  Reported 26-Sep-t937  1937.0        NaN
6919          Ca. 77  A.D.    77.0        NaN
6920            Ca. 5 A.D.     5.0        NaN

In [34]:
df_50_diff = df_50[((df_50['Temp_year'].notna()) & (df_50['Temp_year'] != df_50['Year'])) | (~df_50['Year'].between(1975, 2025))]

df_50_diff[['Date', 'Year', 'Temp_year']].head(20)                      # these are the years that don't match with Year - since its only 19 out of almost 4000 rows, we can remove this data

                      Date    Year  Temp_year
80     2024-07-04 00:00:00  2026.0     2024.0
81     2024-07-04 00:00:00  2025.0     2024.0
517            01-Feb-2010  2020.0     2010.0
551            25-Oct-2019  2018.0     2019.0
609            09-May-2018  2019.0     2018.0
629            18-Feb-2018  2019.0     2018.0
716               Jun-1018  2018.0     1018.0
1394           14-May-2014  2013.0     2014.0
1521              Apr-2013  2012.0     2013.0
1624           26-Jun-2008  2011.0     2008.0
1659  Reported 10-Mar-2010  2011.0     2010.0
1905           06-Dec-2006  2008.0     2006.0
2033         November 2011  2007.0     2011.0
3397           27-Jul-1989  1969.0     1989.0
3685           23-Oct-1962  1982.0     1962.0
4329        Summer of 1996  1966.0     1996.0
4810                 21764  1959.0     2176.0
5060                 19955  1954.0     1995.0
5379            22-Jul-144  1944.0        NaN
5537         Woirld War II  1939.0        NaN

In [35]:
df_50_last_years = df_50.drop(
    columns=["Temp_year", "Match_check", "Time"]).drop(index=df_50_diff.index.tolist() + [6919, 6920])
df_50_last_years

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
1,11th October,2025.0,Unprovoked,Australia,Queensland,Cook Esplanade Thursday Island,Fishing/swimming,Samuel Nai,M,14,Serious abdonminal injuries,N,Tiger or Bull shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,Bronze whaler?
3,29th September,2025.0,Unprovoked,USA,Off California,Catalina Island,Swimming,Christopher Murray,M,54,Leg and foot injury,N,unknown 1.2m shark
4,27th September,2025.0,Provoked,Costa Rica,NaN,Cocos Islands,Diving-Tagging sharks,Dr. Mauricio Hoyos,M,48,Head face and arms,N,Tiger shark 4m
...,...,...,...,...,...,...,...,...,...,...,...,...,...
6969,"No date, Before Mar-1995",1995.0,Unprovoked,FRENCH POLYNESIA,Tuamotus,Rangiroa,Fishing,male,M,NaN,"Speared a shark, fell overboard and another sh...",N,NaN
6970,Before 1996,1996.0,Unprovoked,SUDAN,Red Sea State,Sha'ab Rumi,Diving,Erik Bjurstrom,M,NaN,"No injury, BC ripped",N,Silvertip shark
6971,"No date, Before Aug-1989",1989.0,Unprovoked,VANUATU,Malampa Province,Malakula,NaN,female,F,NaN,FATAL,Y,NaN
6972,"No date, Before Aug-1987",1987.0,Provoked,VANUATU,Malampa Province,"Hokai, Malakula",Attempting to drive shark from area,a chief,M,NaN,Speared shark broke outrigger of canoe throwin...,N,A large hammerhead shark
6973,"No date, Before 1987",1987.0,Unprovoked,IRAN,Khuzestan Province,"Ahvaz, on the Karun River",NaN,Mr. Jabar-Kaaby,M,NaN,Foot severed,N,Bull shark

In [36]:
df_50_last_years = df_50_last_years.sort_values(by='Year', ascending=False)
df_50_last_years

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
13,28th July,2025.0,Unprovoked,Australia,South Australia,Seacliff beach Adelaide,Kayaking,Nathaniel Drummond,M,19,Kayak badly damaged no injury to person,N,Great White Shark est 3m (10ft)
27,2025-06-11 00:00:00,2025.0,Unprovoked,USA,Florida,Boca Grande,Snorkeling,Leah Lendel,F,9,Right hand almost torn off,N,Bull shark
26,17th June,2025.0,Unprovoked,USA,South Carolina,Beach Marker 24 Hilton Head Island,Swimming,Pre-teenage girl,F,12,Laceration to lower right leg,N,Not stated
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,Bronze whaler?
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3912,01-Jun-1976,1976.0,Watercraft,AUSTRALIA,Queensland,Off Stradbroke Island,Sitting in bow of her father's 5 m boat,Debbie McMillan,F,NaN,"Shark jumped in boat, hitting her in the face ...",N,1.5 m [5'] shark
3911,Reported 02-Jun-1976,1976.0,Provoked,ITALY,Reggio Calabria Province,Bovalino,Fishing,Francisco Pelle,M,46,Shark rammed boat PROVOKED INCIDENT,N,"Blue shark, 2m"
3917,09-Mar-1976,1976.0,Watercraft,SOUTH AFRICA,Western Cape Province,"2 km from Macassar, False Bay",NaN,5 m skiboat; Stephanie,NaN,NaN,Shark breached hull of boat,N,White shark named “Spotty”
3916,12-Mar-1976,1976.0,Watercraft,SOUTH AFRICA,Western Cape Province,Robberg Point,Fishing,"boat, occupants: Jacob Kruger & crew",NaN,NaN,"No injury to occupants, shark buckled prop shaft",N,Whale shark
3915,12-Mar-1976,1976.0,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Standing,Glen Wright,M,21 or 26,Lacerations to left leg,N,NaN

# From this point filtered data for last 50 years

In [37]:
df_50_last_years.nunique() # next we need to clean Country, Sex, Age, Fatal
                            # how to clean and sort age and activity??

Date         3342
Year           50
Type           12
Country       154
State         488
Location     2674
Activity      624
Name         3285
Sex             7
Age           205
Injury       2416
Fatal Y/N       8
Species      1187
dtype: int64

## Clean Country

In [38]:
df_50_last_years['Country'].unique()

array(['Australia', 'USA', 'Columbia', 'Costa Rica', 'New Caledonia',
       'Bahamas', 'Philippines', 'Mozambique', 'Canary Islands', 'Spain',
       'French Polynesia', 'Puerto Rico', 'Turks and Caicos', 'Israel',
       'Mexico', 'Maldives', 'South Africa', 'Vanuatu', 'Jamaica',
       'AUSTRALIA', 'TRINIDAD', 'Tobago', 'Indonesia', 'Honduras',
       'Morocco', 'INDIA', 'Hawaii', 'Egypt', 'BAHAMAS', 'SOUTH AFRICA',
       'Maldive Islands', 'Belize', 'New Zealand', 'Thailand',
       'ARGENTINA', 'EGYPT', 'MEXICO', 'NEW CALEDONIA', 'BRAZIL', 'SAMOA',
       'NEW ZEALAND', 'ECUADOR', 'PORTUGAL', 'SEYCHELLES', 'SPAIN',
       'CUBA', 'FIJI', 'COLOMBIA', 'MeXICO', 'Coral Sea',
       'FRENCH POLYNESIA', 'TURKS and CaICOS', 'PHILIPPINES', 'BELIZE',
       'JAPAN', 'MALDIVES', 'COLUMBIA', 'INDONESIA', 'THAILAND',
       'COSTA RICA', 'ENGLAND', 'JAMAICA', 'JORDAN', 'ST KITTS / NEVIS',
       'CANADA', 'British Overseas Territory', 'ST MARTIN', 'CHINA',
       'PAPUA NEW GUINEA', 'REUNION ISLAND', 'ISRAEL', 'ITALY', 'IRELAND',
       'MAURITIUS', nan, 'MALAYSIA', 'UNITED KINGDOM', 'LIBYA', 'COMOROS',
       'REUNION', 'UNITED ARAB EMIRATES', 'SOLOMON ISLANDS',
       'ST HELENA, British overseas territory', 'DOMINICAN REPUBLIC',
       'CAYMAN ISLANDS', 'CAPE VERDE', 'Fiji', 'KENYA', 'ATLANTIC OCEAN',
       'ARUBA', 'MOZAMBIQUE', 'PUERTO RICO', 'GREECE', 'ST. MARTIN',
       'FRANCE', 'TRINIDAD & TOBAGO', 'GUAM', 'DIEGO GARCIA', 'TAIWAN',
       'KIRIBATI', 'PALESTINIAN TERRITORIES', 'SAUDI ARABIA', 'CHILE',
       'CROATIA', 'SCOTLAND', 'NIGERIA', 'TONGA', 'ANTIGUA', 'RUSSIA',
       'TURKS & CAICOS', 'UNITED ARAB EMIRATES (UAE)', 'SUDAN',
       'SOUTH KOREA', 'VIETNAM', 'MADAGASCAR', 'AZORES', 'MALTA',
       'PANAMA', 'SOMALIA', 'NEVIS', 'YEMEN', 'BRITISH VIRGIN ISLANDS',
       'SENEGAL', 'NORWAY', 'GULF OF ADEN', 'Sierra Leone', 'VANUATU',
       'MEXICO ', 'LIBERIA', 'Seychelles', 'HONDURAS', 'VENEZUELA',
       'GRAND CAYMAN', 'ST. MAARTIN', ' TONGA', 'URUGUAY', 'SRI LANKA',
       'MICRONESIA', 'CARIBBEAN SEA', 'TANZANIA', 'OKINAWA',
       'MARSHALL ISLANDS', 'EGYPT / ISRAEL', 'KOREA',
       'NORTHERN ARABIAN SEA', 'HONG KONG', 'ANGOLA', 'EL SALVADOR',
       'IRAN', 'MONTENEGRO', 'TUNISIA', 'NAMIBIA', 'BERMUDA',
       'NORTH ATLANTIC OCEAN', 'SOUTH CHINA SEA'], dtype=object)

In [39]:
df_50_last_years['Country'] = df_50_last_years['Country'].str.strip().str.title()

In [40]:
df_50_last_years['Country'].dropna().sort_values().unique()

array(['Angola', 'Antigua', 'Argentina', 'Aruba', 'Atlantic Ocean',
       'Australia', 'Azores', 'Bahamas', 'Belize', 'Bermuda', 'Brazil',
       'British Overseas Territory', 'British Virgin Islands', 'Canada',
       'Canary Islands', 'Cape Verde', 'Caribbean Sea', 'Cayman Islands',
       'Chile', 'China', 'Colombia', 'Columbia', 'Comoros', 'Coral Sea',
       'Costa Rica', 'Croatia', 'Cuba', 'Diego Garcia',
       'Dominican Republic', 'Ecuador', 'Egypt', 'Egypt / Israel',
       'El Salvador', 'England', 'Fiji', 'France', 'French Polynesia',
       'Grand Cayman', 'Greece', 'Guam', 'Gulf Of Aden', 'Hawaii',
       'Honduras', 'Hong Kong', 'India', 'Indonesia', 'Iran', 'Ireland',
       'Israel', 'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kenya',
       'Kiribati', 'Korea', 'Liberia', 'Libya', 'Madagascar', 'Malaysia',
       'Maldive Islands', 'Maldives', 'Malta', 'Marshall Islands',
       'Mauritius', 'Mexico', 'Micronesia', 'Montenegro', 'Morocco',
       'Mozambique', 'Namibia', 'Nevis', 'New Caledonia', 'New Zealand',
       'Nigeria', 'North Atlantic Ocean', 'Northern Arabian Sea',
       'Norway', 'Okinawa', 'Palestinian Territories', 'Panama',
       'Papua New Guinea', 'Philippines', 'Portugal', 'Puerto Rico',
       'Reunion', 'Reunion Island', 'Russia', 'Samoa', 'Saudi Arabia',
       'Scotland', 'Senegal', 'Seychelles', 'Sierra Leone',
       'Solomon Islands', 'Somalia', 'South Africa', 'South China Sea',
       'South Korea', 'Spain', 'Sri Lanka',
       'St Helena, British Overseas Territory', 'St Kitts / Nevis',
       'St Martin', 'St. Maartin', 'St. Martin', 'Sudan', 'Taiwan',
       'Tanzania', 'Thailand', 'Tobago', 'Tonga', 'Trinidad',
       'Trinidad & Tobago', 'Tunisia', 'Turks & Caicos',
       'Turks And Caicos', 'United Arab Emirates',
       'United Arab Emirates (Uae)', 'United Kingdom', 'Uruguay', 'Usa',
       'Vanuatu', 'Venezuela', 'Vietnam', 'Yemen'], dtype=object)

In [41]:
df_50_last_years.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
13,28th July,2025.0,Unprovoked,Australia,South Australia,Seacliff beach Adelaide,Kayaking,Nathaniel Drummond,M,19,Kayak badly damaged no injury to person,N,Great White Shark est 3m (10ft)
27,2025-06-11 00:00:00,2025.0,Unprovoked,Usa,Florida,Boca Grande,Snorkeling,Leah Lendel,F,9,Right hand almost torn off,N,Bull shark
26,17th June,2025.0,Unprovoked,Usa,South Carolina,Beach Marker 24 Hilton Head Island,Swimming,Pre-teenage girl,F,12,Laceration to lower right leg,N,Not stated
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,Bronze whaler?

In [42]:
df_50_last_years = df_50_last_years.dropna(subset=['Country']) # Removed rows with NaN in "Country"
df_50_last_years

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
13,28th July,2025.0,Unprovoked,Australia,South Australia,Seacliff beach Adelaide,Kayaking,Nathaniel Drummond,M,19,Kayak badly damaged no injury to person,N,Great White Shark est 3m (10ft)
27,2025-06-11 00:00:00,2025.0,Unprovoked,Usa,Florida,Boca Grande,Snorkeling,Leah Lendel,F,9,Right hand almost torn off,N,Bull shark
26,17th June,2025.0,Unprovoked,Usa,South Carolina,Beach Marker 24 Hilton Head Island,Swimming,Pre-teenage girl,F,12,Laceration to lower right leg,N,Not stated
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,Bronze whaler?
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3912,01-Jun-1976,1976.0,Watercraft,Australia,Queensland,Off Stradbroke Island,Sitting in bow of her father's 5 m boat,Debbie McMillan,F,NaN,"Shark jumped in boat, hitting her in the face ...",N,1.5 m [5'] shark
3911,Reported 02-Jun-1976,1976.0,Provoked,Italy,Reggio Calabria Province,Bovalino,Fishing,Francisco Pelle,M,46,Shark rammed boat PROVOKED INCIDENT,N,"Blue shark, 2m"
3917,09-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,"2 km from Macassar, False Bay",NaN,5 m skiboat; Stephanie,NaN,NaN,Shark breached hull of boat,N,White shark named “Spotty”
3916,12-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,Robberg Point,Fishing,"boat, occupants: Jacob Kruger & crew",NaN,NaN,"No injury to occupants, shark buckled prop shaft",N,Whale shark
3915,12-Mar-1976,1976.0,Unprovoked,Usa,Florida,"New Smyrna Beach, Volusia County",Standing,Glen Wright,M,21 or 26,Lacerations to left leg,N,NaN

## Clean Sex

In [43]:
df_50_last_years['Sex'].unique()

array(['M', 'F', 'F ', 'M ', nan, ' M', 'm', 'lli'], dtype=object)

In [44]:
df_50_last_years['Sex'] = df_50_last_years['Sex'].str.strip().str.upper()
df_50_last_years['Sex'].unique()

C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\4248088207.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Sex'] = df_50_last_years['Sex'].str.strip().str.upper()

array(['M', 'F', nan, 'LLI'], dtype=object)

In [45]:
df_50_last_years[df_50_last_years['Sex'] == "LLI"] # there is only one row with LLI in a column Sex, so I will change it to NaN

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
2344,11-Nov-2004,2004.0,Unprovoked,Usa,California,"Bunkers, Humboldt Bay, Eureka, Humboldt County",Surfing,Brian Kang,LLI,38,"Lacerations to hand, knee & thigh",N,5.5 m [18'] white shark

In [46]:
df_50_last_years['Sex'] = df_50_last_years['Sex'].replace('LLI', np.nan)

C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\1845379289.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Sex'] = df_50_last_years['Sex'].replace('LLI', np.nan)

In [47]:
df_50_last_years[df_50_last_years['Sex'].isna()]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
162,Reported 14 Jul-2023,2023.0,Watercraft,South Africa,Eastern Cape Province,Chinta East,Watching the sardine run,crew,NaN,NaN,"No injury to occupants, shark defated boat",N,NaN
146,23 Aug-2023,2023.0,Unprovoked,Usa,North Carolina,"Oak Island, Brunswick County",Wading,child,NaN,9,Minor injury to shoulder,N,NaN
253,19-Jul-2022,2022.0,Questionable,Usa,Florida,"Cape Canaveral, Brevard County",NaN,NaN,NaN,NaN,minor injuries,N,Shark involvement not confirmed
281,07-May-2022,2022.0,Unprovoked,French Polynesia,Bora Bora,To'opua,NaN,NaN,NaN,NaN,Hand bitten,N,NaN
277,27-May-2022,2022.0,Unprovoked,Australia,Western Australia,Yallingup,Surfing,NaN,NaN,NaN,Knocked off board by a shark. No injury,N,"Bronze whaler shark, 2m"
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3897,22-Sep-1976,1976.0,Sea Disaster,New Caledonia,NaN,Sarcelle,Shipwreck,a small boat,NaN,NaN,It was believed that survivors were killed by ...,N,NaN
3914,28-Apr-1976,1976.0,Invalid,Usa,Texas,Galveston Island,NaN,Unknown,NaN,NaN,"Possible drowning victim, remains retrieved fr...",NaN,Shark involvement prior to death was not confi...
3913,02-May-1976,1976.0,Watercraft,South Africa,Western Cape Province,40 km off Cape Point,Competing in a light tackle game fishing,"6 m skiboat, occupants: Terry McManus, Dan Cla...",NaN,NaN,"Shark following hooked fish, rammed & holed boat",N,"Mako shark, 180-kg [397-lb]"
3917,09-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,"2 km from Macassar, False Bay",NaN,5 m skiboat; Stephanie,NaN,NaN,Shark breached hull of boat,N,White shark named “Spotty”
3916,12-Mar-1976,1976.0,Watercraft,South Africa,Western Cape Province,Robberg Point,Fishing,"boat, occupants: Jacob Kruger & crew",NaN,NaN,"No injury to occupants, shark buckled prop shaft",N,Whale shark

## Clean Fatal

In [48]:
df_50_last_years['Fatal Y/N'].unique()

array(['N', 'Y', 'F', nan, 'M', 'n', 'Nq', 'UNKNOWN', 2017], dtype=object)

In [49]:
df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].str.strip().str.upper()
df_50_last_years['Fatal Y/N'].unique()

C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\1294677114.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].str.strip().str.upper()

array(['N', 'Y', 'F', nan, 'M', 'NQ', 'UNKNOWN'], dtype=object)

In [50]:
df_50_last_years['Fatal Y/N'].value_counts(dropna=False)

Fatal Y/N
N          3202
Y           430
NaN         265
UNKNOWN      24
F             5
M             3
NQ            1
Name: count, dtype: int64

In [51]:
df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].replace({'UNKNOWN': np.nan,'NQ': np.nan,'M': np.nan,'F': 'Y'})

C:\Users\Anna\AppData\Local\Temp\ipykernel_21332\702274590.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_50_last_years['Fatal Y/N'] = df_50_last_years['Fatal Y/N'].replace({'UNKNOWN': np.nan,'NQ': np.nan,'M': np.nan,'F': 'Y'})

In [52]:
df_50_last_years['Fatal Y/N'].value_counts(dropna=False)

Fatal Y/N
N      3202
Y       435
NaN     293
Name: count, dtype: int64

In [53]:
df_50_last_years.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,Injury,Fatal Y/N,Species
13,28th July,2025.0,Unprovoked,Australia,South Australia,Seacliff beach Adelaide,Kayaking,Nathaniel Drummond,M,19,Kayak badly damaged no injury to person,N,Great White Shark est 3m (10ft)
27,2025-06-11 00:00:00,2025.0,Unprovoked,Usa,Florida,Boca Grande,Snorkeling,Leah Lendel,F,9,Right hand almost torn off,N,Bull shark
26,17th June,2025.0,Unprovoked,Usa,South Carolina,Beach Marker 24 Hilton Head Island,Swimming,Pre-teenage girl,F,12,Laceration to lower right leg,N,Not stated
0,14th October,2025.0,Unprovoked,Columbia,"Bolivar, del Isolate",Catagena Province,Swimming with sharks,Male child,M,14,Severe hand injury,N,Nurse shark
2,7th October,2025.0,Unprovoked,Australia,South Australia,Kangaroo Island,Surfing,Lee Berryman,M,50+,Lacerations to calf,N,Bronze whaler?

In [54]:
df_50_last_years.to_csv("data/interim/1_interim_clean_50_years_countries_sex_fatal.csv", index=False)